# GetLockCallback Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransactWithCentralOptions..::..GetLockCallback Method
TransactWithCentralOptions Class See Also
---
Gets the callback object that changes Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ICentralLockedCallback GetLockCallback()
```

Visual Basic
---
```text
Public Function GetLockCallback As ICentralLockedCallback
```

Visual C++
---
```text
public:
ICentralLockedCallback^ GetLockCallback()
```

# See Also
TransactWithCentralOptions Class
Autodesk.Revit.DB Namespace